In [1]:
people = {
        "first" : ["Arslan", 'Anaconda', 'Pru'],
        "last"  : ["Amanov", 'Python','Prudential'], 
        "email" : ["arslan.amanov@gmail.com",'Anaconda.python@gmail.com','Prudential.thailand@gmail.com']
     }

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

      first        last                          email
0    Arslan      Amanov        arslan.amanov@gmail.com
1  Anaconda      Python      Anaconda.python@gmail.com
2       Pru  Prudential  Prudential.thailand@gmail.com

In [8]:
#add and remove columns 
# first lets try to add columns 
# try to add firstname and lastname together 

df['first'] + ' ' + df['last']

0      Arslan Amanov
1    Anaconda Python
2     Pru Prudential
dtype: object

In [10]:
df['full_name'] = df['first'] + ' ' + df['last']

In [11]:
df

      first        last                          email        full_name
0    Arslan      Amanov        arslan.amanov@gmail.com    Arslan Amanov
1  Anaconda      Python      Anaconda.python@gmail.com  Anaconda Python
2       Pru  Prudential  Prudential.thailand@gmail.com   Pru Prudential

In [13]:
df.drop(columns = ['first', 'last'], inplace = True)

In [14]:
df

                           email        full_name
0        arslan.amanov@gmail.com    Arslan Amanov
1      Anaconda.python@gmail.com  Anaconda Python
2  Prudential.thailand@gmail.com   Pru Prudential

In [16]:
df['full_name'].str.split(' ', expand=True)

          0           1
0    Arslan      Amanov
1  Anaconda      Python
2       Pru  Prudential

In [17]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [18]:
df

                           email        full_name     first        last
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential

In [20]:
df.append({'first': 'Tony'}, ignore_index = True)

                           email        full_name     first        last
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                            NaN              NaN      Tony         NaN

In [25]:
people = {
        'first' : ['Alpha', 'Kobra'],
        'last'  : ['Beta', 'Python'], 
        'email' : ['alpha@gmail.com','python@gmail.com']
     }

df2 = pd.DataFrame(people)

In [27]:
df2

   first    last             email
0  Alpha    Beta   alpha@gmail.com
1  Kobra  Python  python@gmail.com

In [28]:
df.append(df2, ignore_index = True)

                           email        full_name     first        last
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta
4               python@gmail.com              NaN     Kobra      Python

In [29]:
df = df.append(df2, ignore_index = True)

In [30]:
df

                           email        full_name     first        last
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta
4               python@gmail.com              NaN     Kobra      Python

In [31]:
#remove rows using drop method 

df.drop(index = 4)

                           email        full_name     first        last
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta

In [35]:
filt = df['last'] == 'Python'

df.drop(index=df[filt].index)  #### easier to read assigning the values

                           email       full_name   first        last
0        arslan.amanov@gmail.com   Arslan Amanov  Arslan      Amanov
2  Prudential.thailand@gmail.com  Pru Prudential     Pru  Prudential
3                alpha@gmail.com             NaN   Alpha        Beta

In [36]:
#### Sorting Data  


df.sort_values(by = 'last')

                           email        full_name     first        last
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov
3                alpha@gmail.com              NaN     Alpha        Beta
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
4               python@gmail.com              NaN     Kobra      Python

In [38]:
## Sorting with descending or ascending order 

df.sort_values(by = 'last', ascending = False)

                           email        full_name     first        last
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
4               python@gmail.com              NaN     Kobra      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov

In [39]:
# sort by last name and first name   


df.sort_values(by = ['last', 'first'], ascending = False)

                           email        full_name     first        last
4               python@gmail.com              NaN     Kobra      Python
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov

In [41]:
df.sort_values(by = ['last', 'first'], ascending = [False, True] , inplace = True)

In [42]:
df

                           email        full_name     first        last
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
4               python@gmail.com              NaN     Kobra      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov

In [43]:
df.sort_index()

                           email        full_name     first        last
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta
4               python@gmail.com              NaN     Kobra      Python

In [44]:
df

                           email        full_name     first        last
1      Anaconda.python@gmail.com  Anaconda Python  Anaconda      Python
4               python@gmail.com              NaN     Kobra      Python
2  Prudential.thailand@gmail.com   Pru Prudential       Pru  Prudential
3                alpha@gmail.com              NaN     Alpha        Beta
0        arslan.amanov@gmail.com    Arslan Amanov    Arslan      Amanov

In [45]:
df['last'].sort_values()

0        Amanov
3          Beta
2    Prudential
1        Python
4        Python
Name: last, dtype: object